node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 204
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 204
          }
        }
        tensor_content: "\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\013\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "tensors/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 204
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 204
          }
        }
        tensor_content: "\202\000\000\000\000\000\000\000\252\000\000\000\000\000\000\000\252\000\000\000\000\000\000\000\252\000\000\000\000\000\000\000\264\000\000\000\000\000\000\000\264\000\000\000\000\000\000\000\264\000\000\000\000\000\000\000\276\000\000\000\000\000\000\000\310\000\000\000\000\000\000\000\310\000\000\000\000\000\000\000\322\000\000\000\000\000\000\000\322\000\000\000\000\000\000\000\322\000\000\000\000\000\000\000\322\000\000\000\000\000\000\000\334\000\000\000\000\000\000\000\334\000\000\000\000\000\000\000\346\000\000\000\000\000\000\000\346\000\000\000\000\000\000\000\346\000\000\000\000\000\000\000\346\000\000\000\000\000\000\000\346\000\000\000\000\000\000\000\346\000\000\000\000\000\000\000\360\000\000\000\000\000\000\000\360\000\000\000\000\000\000\000\360\000\000\000\000\000\000\000\372\000\000\000\000\000\000\000\372\000\000\000\000\000\000\000\372\000\000\000\000\000\000\000\372\000\000\000\000\000\000\000\004\001\000\000\000\000\000\000\004\001\000\000\000\000\000\000\004\001\000\000\000\000\000\000\016\001\000\000\000\000\000\000\016\001\000\000\000\000\000\000\016\001\000\000\000\000\000\000\030\001\000\000\000\000\000\000\"\001\000\000\000\000\000\000\"\001\000\000\000\000\000\000h\001\000\000\000\000\000\000w\000\000\000\000\000\000\000w\000\000\000\000\000\000\000{\000\000\000\000\000\000\000\177\000\000\000\000\000\000\000\201\000\000\000\000\000\000\000\205\000\000\000\000\000\000\000\206\000\000\000\000\000\000\000\213\000\000\000\000\000\000\000\220\000\000\000\000\000\000\000\222\000\000\000\000\000\000\000\224\000\000\000\000\000\000\000\230\000\000\000\000\000\000\000\231\000\000\000\000\000\000\000\232\000\000\000\000\000\000\000\232\000\000\000\000\000\000\000\233\000\000\000\000\000\000\000\233\000\000\000\000\000\000\000\234\000\000\000\000\000\000\000\234\000\000\000\000\000\000\000\235\000\000\000\000\000\000\000\235\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\241\000\000\000\000\000\000\000\242\000\000\000\000\000\000\000\243\000\000\000\000\000\000\000\244\000\000\000\000\000\000\000\245\000\000\000\000\000\000\000\245\000\000\000\000\000\000\000\245\000\000\000\000\000\000\000\246\000\000\000\000\000\000\000\246\000\000\000\000\000\000\000\247\000\000\000\000\000\000\000\247\000\000\000\000\000\000\000\247\000\000\000\000\000\000\000\250\000\000\000\000\000\000\000\250\000\000\000\000\000\000\000\250\000\000\000\000\000\000\000\250\000\000\000\000\000\000\000\253\000\000\000\000\000\000\000\253\000\000\000\000\000\000\000\253\000\000\000\000\000\000\000\253\000\000\000\000\000\000\000\253\000\000\000\000\000\000\000\254\000\000\000\000\000\000\000\255\000\000\000\000\000\000\000\256\000\000\000\000\000\000\000\256\000\000\000\000\000\000\000\257\000\000\000\000\000\000\000\257\000\000\000\000\000\000\000\260\000\000\000\000\000\000\000\261\000\000\000\000\000\000\000\261\000\000\000\000\000\000\000\262\000\000\000\000\000\000\000\263\000\000\000\000\000\000\000\265\000\000\000\000\000\000\000\266\000\000\000\000\000\000\000\266\000\000\000\000\000\000\000\271\000\000\000\000\000\000\000\271\000\000\000\000\000\000\000\271\000\000\000\000\000\000\000\271\000\000\000\000\000\000\000\272\000\000\000\000\000\000\000\272\000\000\000\000\000\000\000\274\000\000\000\000\000\000\000\274\000\000\000\000\000\000\000\274\000\000\000\000\000\000\000\275\000\000\000\000\000\000\000\275\000\000\000\000\000\000\000\277\000\000\000\000\000\000\000\277\000\000\000\000\000\000\000\300\000\000\000\000\000\000\000\300\000\000\000\000\000\000\000\301\000\000\000\000\000\000\000\301\000\000\000\000\000\000\000\302\000\000\000\000\000\000\000\304\000\000\000\000\000\000\000\304\000\000\000\000\000\000\000\304\000\000\000\000\000\000\000\305\000\000\000\000\000\000\000\305\000\000\000\000\000\000\000\305\000\000\000\000\000\000\000\306\000\000\000\000\000\000\000\307\000\000\000\000\000\000\000\307\000\000\000\000\000\000\000\307\000\000\000\000\000\000\000\323\000\000\000\000\000\000\000\324\000\000\000\000\000\000\000\324\000\000\000\000\000\000\000\325\000\000\000\000\000\000\000\325\000\000\000\000\000\000\000\326\000\000\000\000\000\000\000\326\000\000\000\000\000\000\000\326\000\000\000\000\000\000\000\326\000\000\000\000\000\000\000\326\000\000\000\000\000\000\000\326\000\000\000\000\000\000\000\326\000\000\000\000\000\000\000\327\000\000\000\000\000\000\000\327\000\000\000\000\000\000\000\330\000\000\000\000\000\000\000\331\000\000\000\000\000\000\000\331\000\000\000\000\000\000\000\332\000\000\000\000\000\000\000\332\000\000\000\000\000\000\000\335\000\000\000\000\000\000\000\336\000\000\000\000\000\000\000\336\000\000\000\000\000\000\000\336\000\000\000\000\000\000\000\340\000\000\000\000\000\000\000\340\000\000\000\000\000\000\000\340\000\000\000\000\000\000\000\342\000\000\000\000\000\000\000\344\000\000\000\000\000\000\000\345\000\000\000\000\000\000\000\345\000\000\000\000\000\000\000\345\000\000\000\000\000\000\000\347\000\000\000\000\000\000\000\347\000\000\000\000\000\000\000\347\000\000\000\000\000\000\000\347\000\000\000\000\000\000\000\350\000\000\000\000\000\000\000\351\000\000\000\000\000\000\000\351\000\000\000\000\000\000\000\352\000\000\000\000\000\000\000\353\000\000\000\000\000\000\000\354\000\000\000\000\000\000\000\354\000\000\000\000\000\000\000\354\000\000\000\000\000\000\000\355\000\000\000\000\000\000\000\356\000\000\000\000\000\000\000\356\000\000\000\000\000\000\000\361\000\000\000\000\000\000\000\362\000\000\000\000\000\000\000\362\000\000\000\000\000\000\000\362\000\000\000\000\000\000\000\363\000\000\000\000\000\000\000\364\000\000\000\000\000\000\000\364\000\000\000\000\000\000\000\364\000\000\000\000\000\000\000\365\000\000\000\000\000\000\000\365\000\000\000\000\000\000\000\366\000\000\000\000\000\000\000\367\000\000\000\000\000\000\000\367\000\000\000\000\000\000\000\367\000\000\000\000\000\000\000\371\000\000\000\000\000\000\000\377\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\002\001\000\000\000\000\000\000\003\001\000\000\000\000\000\000\006\001\000\000\000\000\000\000\006\001\000\000\000\000\000\000\007\001\000\000\000\000\000\000\007\001\000\000\000\000\000\000\t\001\000\000\000\000\000\000\t\001\000\000\000\000\000\000\014\001\000\000\000\000\000\000\017\001\000\000\000\000\000\000\017\001\000\000\000\000\000\000\020\001\000\000\000\000\000\000\021\001\000\000\000\000\000\000\022\001\000\000\000\000\000\000\031\001\000\000\000\000\000\000%\001\000\000\000\000\000\000)\001\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "tensors/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 204
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 204
          }
        }
        tensor_content: "\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\216\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\236\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000h\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000\226\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "tensors/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 204
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 204
          }
        }
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " M"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
        string_val: " F"
      }
    }
  }
}
node {
  name: "tensors/component_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 204
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 204
          }
        }
        tensor_content: "F\001\000\000\000\000\000\000t\001\000\000\000\000\000\000t\001\000\000\000\000\000\000t\001\000\000\000\000\000\000\177\001\000\000\000\000\000\000\177\001\000\000\000\000\000\000\177\001\000\000\000\000\000\000\212\001\000\000\000\000\000\000\224\001\000\000\000\000\000\000\224\001\000\000\000\000\000\000\225\001\000\000\000\000\000\000\236\001\000\000\000\000\000\000\236\001\000\000\000\000\000\000\236\001\000\000\000\000\000\000\250\001\000\000\000\000\000\000\250\001\000\000\000\000\000\000\261\001\000\000\000\000\000\000\261\001\000\000\000\000\000\000\261\001\000\000\000\000\000\000\261\001\000\000\000\000\000\000\261\001\000\000\000\000\000\000\261\001\000\000\000\000\000\000\230\001\000\000\000\000\000\000\230\001\000\000\000\000\000\000\230\001\000\000\000\000\000\000\231\001\000\000\000\000\000\000\304\001\000\000\000\000\000\000\304\001\000\000\000\000\000\000\304\001\000\000\000\000\000\000\232\001\000\000\000\000\000\000\232\001\000\000\000\000\000\000\232\001\000\000\000\000\000\000\233\001\000\000\000\000\000\000\325\001\000\000\000\000\000\000\325\001\000\000\000\000\000\000\234\001\000\000\000\000\000\000\346\001\000\000\000\000\000\000\346\001\000\000\000\000\000\000\364\001\000\000\000\000\000\0008\001\000\000\000\000\000\0008\001\000\000\000\000\000\000=\001\000\000\000\000\000\000B\001\000\000\000\000\000\000D\001\000\000\000\000\000\000I\001\000\000\000\000\000\000K\001\000\000\000\000\000\000Q\001\000\000\000\000\000\000W\001\000\000\000\000\000\000Y\001\000\000\000\000\000\000[\001\000\000\000\000\000\000`\001\000\000\000\000\000\000a\001\000\000\000\000\000\000c\001\000\000\000\000\000\000c\001\000\000\000\000\000\000d\001\000\000\000\000\000\000d\001\000\000\000\000\000\000e\001\000\000\000\000\000\000e\001\000\000\000\000\000\000f\001\000\000\000\000\000\000f\001\000\000\000\000\000\000g\001\000\000\000\000\000\000j\001\000\000\000\000\000\000l\001\000\000\000\000\000\000m\001\000\000\000\000\000\000n\001\000\000\000\000\000\000o\001\000\000\000\000\000\000o\001\000\000\000\000\000\000o\001\000\000\000\000\000\000p\001\000\000\000\000\000\000p\001\000\000\000\000\000\000q\001\000\000\000\000\000\000q\001\000\000\000\000\000\000q\001\000\000\000\000\000\000r\001\000\000\000\000\000\000r\001\000\000\000\000\000\000r\001\000\000\000\000\000\000r\001\000\000\000\000\000\000u\001\000\000\000\000\000\000u\001\000\000\000\000\000\000v\001\000\000\000\000\000\000v\001\000\000\000\000\000\000v\001\000\000\000\000\000\000w\001\000\000\000\000\000\000x\001\000\000\000\000\000\000y\001\000\000\000\000\000\000y\001\000\000\000\000\000\000z\001\000\000\000\000\000\000z\001\000\000\000\000\000\000{\001\000\000\000\000\000\000|\001\000\000\000\000\000\000|\001\000\000\000\000\000\000}\001\000\000\000\000\000\000~\001\000\000\000\000\000\000\200\001\000\000\000\000\000\000\201\001\000\000\000\000\000\000\201\001\000\000\000\000\000\000\204\001\000\000\000\000\000\000\205\001\000\000\000\000\000\000\205\001\000\000\000\000\000\000\205\001\000\000\000\000\000\000\206\001\000\000\000\000\000\000\206\001\000\000\000\000\000\000\210\001\000\000\000\000\000\000\210\001\000\000\000\000\000\000\210\001\000\000\000\000\000\000\211\001\000\000\000\000\000\000\211\001\000\000\000\000\000\000\213\001\000\000\000\000\000\000\213\001\000\000\000\000\000\000\214\001\000\000\000\000\000\000\214\001\000\000\000\000\000\000\215\001\000\000\000\000\000\000\215\001\000\000\000\000\000\000\216\001\000\000\000\000\000\000\220\001\000\000\000\000\000\000\220\001\000\000\000\000\000\000\220\001\000\000\000\000\000\000\221\001\000\000\000\000\000\000\221\001\000\000\000\000\000\000\221\001\000\000\000\000\000\000\222\001\000\000\000\000\000\000\223\001\000\000\000\000\000\000\223\001\000\000\000\000\000\000\223\001\000\000\000\000\000\000\237\001\000\000\000\000\000\000\240\001\000\000\000\000\000\000\240\001\000\000\000\000\000\000\241\001\000\000\000\000\000\000\241\001\000\000\000\000\000\000\242\001\000\000\000\000\000\000\242\001\000\000\000\000\000\000\242\001\000\000\000\000\000\000\242\001\000\000\000\000\000\000\242\001\000\000\000\000\000\000\242\001\000\000\000\000\000\000\242\001\000\000\000\000\000\000\243\001\000\000\000\000\000\000\243\001\000\000\000\000\000\000\244\001\000\000\000\000\000\000\245\001\000\000\000\000\000\000\245\001\000\000\000\000\000\000\246\001\000\000\000\000\000\000\246\001\000\000\000\000\000\000\251\001\000\000\000\000\000\000\252\001\000\000\000\000\000\000\252\001\000\000\000\000\000\000\252\001\000\000\000\000\000\000\253\001\000\000\000\000\000\000\253\001\000\000\000\000\000\000\253\001\000\000\000\000\000\000\255\001\000\000\000\000\000\000\257\001\000\000\000\000\000\000\260\001\000\000\000\000\000\000\260\001\000\000\000\000\000\000\260\001\000\000\000\000\000\000\262\001\000\000\000\000\000\000\262\001\000\000\000\000\000\000\262\001\000\000\000\000\000\000\262\001\000\000\000\000\000\000\263\001\000\000\000\000\000\000\264\001\000\000\000\000\000\000\264\001\000\000\000\000\000\000\265\001\000\000\000\000\000\000\266\001\000\000\000\000\000\000\267\001\000\000\000\000\000\000\267\001\000\000\000\000\000\000\267\001\000\000\000\000\000\000\270\001\000\000\000\000\000\000\271\001\000\000\000\000\000\000\271\001\000\000\000\000\000\000\273\001\000\000\000\000\000\000\274\001\000\000\000\000\000\000\274\001\000\000\000\000\000\000\274\001\000\000\000\000\000\000\275\001\000\000\000\000\000\000\276\001\000\000\000\000\000\000\276\001\000\000\000\000\000\000\276\001\000\000\000\000\000\000\277\001\000\000\000\000\000\000\277\001\000\000\000\000\000\000\300\001\000\000\000\000\000\000\301\001\000\000\000\000\000\000\301\001\000\000\000\000\000\000\301\001\000\000\000\000\000\000\303\001\000\000\000\000\000\000\310\001\000\000\000\000\000\000\311\001\000\000\000\000\000\000\313\001\000\000\000\000\000\000\314\001\000\000\000\000\000\000\316\001\000\000\000\000\000\000\316\001\000\000\000\000\000\000\317\001\000\000\000\000\000\000\317\001\000\000\000\000\000\000\321\001\000\000\000\000\000\000\321\001\000\000\000\000\000\000\324\001\000\000\000\000\000\000\326\001\000\000\000\000\000\000\326\001\000\000\000\000\000\000\327\001\000\000\000\000\000\000\330\001\000\000\000\000\000\000\331\001\000\000\000\000\000\000\337\001\000\000\000\000\000\000\351\001\000\000\000\000\000\000\354\001\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "tensors/component_5"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 204
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 204
          }
        }
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri duble"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri simple"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble greutate"
        string_val: " sarituri duble greutate"
        string_val: " sarituri duble"
        string_val: " sarituri duble"
        string_val: " sarituri duble"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri simple"
        string_val: " sarituri simple"
        string_val: " sarituri simple"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri simple"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri simple"
        string_val: " sarituri simple"
        string_val: " sarituri ca mingea"
        string_val: " sarituri simple"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri simple"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri simple"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri duble"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea "
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri duble"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri duble"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble"
        string_val: " sarituri ca mingea"
        string_val: " sarituri duble"
        string_val: " sarituri ca mingea"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri duble greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri simple"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri simple"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri simple cu greutate"
        string_val: " sarituri ca mingea cu greutate"
        string_val: " sarituri ca mingea cu greutate"
      }
    }
  }
}
node {
  name: "tensors/component_6"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 204
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 204
          }
        }
